# Domain Enumeration

Source: https://www.revitapidocs.com/2026/e4c76674-370f-a9e7-728b-80a6db6430cc.htm

---

| Domain Enumeration |
| --- |

Type of connector domain.
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public enum Domain
```

```
Public Enumeration Domain
```

```
public enum class Domain
```

```
type Domain
```
Members

| Member name | Value | Description |
| --- | --- | --- |
| DomainCableTrayConduit | 4 | Connector of cable trays or conduits |
| DomainElectrical | 2 | Electrical connector |
| DomainHvac | 1 | HVAC (duct) connector |
| DomainPiping | 3 | Piping connector |
| DomainStructuralAnalytical | 5 | Connector of Structural Analytical Model |
| DomainUndefined | 0 | Domain is undefined |

See Also

#### Reference

Autodesk.Revit.DB Namespace